DataProcessors/ОбменЭСФ/Templates/ЗапросQueryNotificationUpdates/Ext/Template.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:esf="esf">
   <soapenv:Header/>
   <soapenv:Body>
      <esf:journalNotificationRequest>
         <sessionId>[sessionId]</sessionId>
         <lastMessageId>[lastMessageId]</lastMessageId>
         <startDate>[startDate]</startDate>
         <!--Optional:-->
         [notificationTypes]
         <blockSize>[blockSize]</blockSize>
      </esf:journalNotificationRequest>
   </soapenv:Body>
</soapenv:Envelope>